####非参数检验###
##非参数检验不需要知道总体的分布。但是没有参数检验精确
##例9.1
y=c(21240,4632,22836,5484,5052,5064,6972,7596,14760,15012,18720,9480,4728,67200,52788)
ri=rank(y)##求秩，在此例中对应的值就是数据中的顺序
##如果有两个值得顺序位置一样的话，两个数的秩都是前面一个数的秩加0.5

### K-S检验
ks.test(yi,"pnorm")##第一个数必须是要检验的数据，第二个是要检验的数据分布类型

###单样本符号秩检验
stem(y)###做茎叶图
wilcox.test(y,mu=5080)##mu代表中位数


#####两独立样本检验
###两独立样本的K-S检验
x1=c(48,47,44,45,46,47,43,47,42,48)
x2=c(36,45,47,38,39,42,36,42,46,35)
boxplot(x1,x2.horizontal=T,names=c("x1","x2"))###做箱线图
##ks检验
ks.test(x1,x2)##两样本检验


###两样本的秩和检验
##函数wilcox.test
wilcox.test(x1,x2)

####多个独立样本的秩和检验
##用来检验多个总体的位置参数是否是一样的
kruskal.test(weight~group,data=PlantGrowth)
##例9.4若干个人对学生奖学金的评级问题
读入数据
scores=c(4,3,4,5,2,3,4,5,4,4,5,5,4,5,4,4,3,4,2,4,5,5,4,4)
person=c(1,1,1,1,1,1,1,1,2,2,2,2,2,2,2,2,3,3,3,3,3,3,3,3)
boxplot(scores~person)##做箱线图看直观上的反应
kruskal.test(scores~person)
oneway.test(scores~person)###方差分析，前提必须是服从正态分布



















